Repository: osaurus-ai/osaurus
Catalog: Packages/OsaurusCore/Resources/Localizable.xcstrings
Source language: en
Languages: ko, ru, zh_hans, zh_hant

source: Update them all at once
zh_hans: 一次性全部更新
zh_hant: 一次性全部更新

# Updated %lld of %lld plugins
source: Updated %1$lld of %2$lld plugins
zh_hans: 已更新 %1$lld/%2$lld 个插件
zh_hant: 已更新 %1$lld/%2$lld 個插件

source: Updated %lld plugins
zh_hans: 已更新 %lld 个插件
zh_hant: 已更新 %lld 個插件

source: Updating...
zh_hans: 正在更新…
zh_hant: 正在更新…

source: Usable budget
zh_hans: 可用预算
zh_hant: 可用預算

source: Usable conversation budget
zh_hans: 可用对话预算
zh_hant: 可用對話預算

source: Usage cost
zh_hans: 使用成本
zh_hant: 使用成本

source: Usage rows
zh_hans: 使用行数
zh_hant: 使用行數

source: Use MLX models from ~/.cache/huggingface, HF_HOME / HF_HUB_CACHE, or a custom folder.
zh_hans: 使用来自 ~/.cache/huggingface、HF_HOME / HF_HUB_CACHE 或自定义文件夹的 MLX 模型。
zh_hant: 使用來自 ~/.cache/huggingface、HF_HOME / HF_HUB_CACHE 或自定義資料夾的 MLX 模型。

source: Use Mock Data (%lld models)
zh_hans: 使用模拟数据（%lld 个模型）
zh_hant: 使用模擬數據（%lld 個模型）

source: Use Mock Data (1 model)
zh_hans: 使用模拟数据（1 个模型）
zh_hant: 使用模擬數據（1 個模型）

source: Use Osaurus balance when search credits run out
zh_hans: 搜索积分用完时使用 Osaurus 余额
zh_hant: 搜尋積分用完時使用 Osaurus 餘額

source: Use Telegram getUpdates as the local desktop receive path. Only enable this when no other consumer is polling the same bot.
zh_hans: 使用 Telegram getUpdates 作为本地桌面接收路径。仅在没有其他消费者轮询同一机器人时启用此项。
zh_hant: 使用 Telegram getUpdates 作為本機桌面接收路徑。僅在沒有其他消費者輪詢同一機器人時啟用此項。

source: Using built-in sources
zh_hans: 使用内置源
zh_hant: 使用內置源

source: Validate & Save
zh_hans: 验证并保存
zh_hant: 驗證並儲存

source: Verb
zh_hans: 动作
zh_hant: 動作

source: Verb baseline: %@
zh_hans: 动作基线：%@
zh_hant: 動作基線：%@

source: Verify
zh_hans: 验证
zh_hant: 驗證

source: Verify an incoming message
zh_hans: 验证传入消息
zh_hant: 驗證傳入訊息

source: Verify incoming message
zh_hans: 验证传入消息
zh_hant: 驗證傳入訊息

source: Versions
zh_hans: 版本
zh_hant: 版本

# via %@ · %@s
source: via %1$@ · %2$@s
zh_hans: 通过 %@ · %@s
zh_hant: 透過 %@ · %@s

source: View Chat
zh_hans: 查看聊天
zh_hant: 檢視聊天

source: Voice Activity Detection
zh_hans: 语音活动检测
zh_hant: 語音活動偵測

source: Voice Models
zh_hans: 语音模型
zh_hant: 語音模型

source: Voice output lives in General → Configure → Voice; the greeting text and personality are in General → Appearance → Empty State.
zh_hans: 语音输出在通用 → 配置 → 语音中；问候文本和个性在通用 → 外观 → 空状态中。
zh_hant: 語音輸出在通用 → 設定 → 語音中；問候文字和個性在通用 → 外觀 → 空狀態中。

source: Voice Temperature
zh_hans: 语音温度
zh_hant: 語音溫度

source: Wait
zh_hans: 等待
zh_hant: 等待

source: Waiting for a Discord message. Send the test message now from an authorized sender in a readable channel.
zh_hans: 等待 Discord 消息。现在从可读频道中的授权发送者发送测试消息。
zh_hant: 等待 Discord 訊息。現在從可讀頻道中的授權傳送者傳送測試訊息。

source: Waiting for a Discord message...
zh_hans: 等待 Discord 消息...
zh_hant: 等待 Discord 訊息...

source: Waiting for a Slack message. Send the test message now from an authorized sender in a readable channel.
zh_hans: 等待 Slack 消息。现在从可读频道中的授权发送者发送测试消息。
zh_hant: 等待 Slack 訊息。現在從可讀頻道中的授權傳送者傳送測試訊息。

source: Waiting for a Slack message...
zh_hans: 等待 Slack 消息...
zh_hant: 等待 Slack 訊息...

source: Waiting for a Telegram message. Send the bot a message now from an authorized sender in a readable chat.
zh_hans: 等待 Telegram 消息。现在从可读聊天中的授权发送者向机器人发送消息。
zh_hant: 等待 Telegram 訊息。現在從可讀聊天中的授權傳送者向機器人傳送訊息。

source: Waiting for a Telegram message...
zh_hans: 等待 Telegram 消息...
zh_hant: 等待 Telegram 訊息...

source: Wake Word
zh_hans: 唤醒词
zh_hant: 啟動詞

source: Want better results?
zh_hans: 想要更好的结果？
zh_hant: 想要更好的結果？

source: Warming up — loading model…
zh_hans: 预热 — 正在加载模型…
zh_hant: 預熱 — 載入模型…

source: Warming up — prefilling context %lld% (%lld/1 token)
zh_hans: 预热中 — 预填充上下文 %lld%%（%lld/1 token）
zh_hant: 預熱中 — 預填充上下文 %lld%%（%lld/1 token）

# Warming up — prefilling context %lld%% (%lld/%lld tokens)
source: Warming up — prefilling context %1$lld%% (%2$lld/%3$lld tokens)
zh_hans: 预热 — 上下文预填充 %1$lld%% (%2$lld/%3$lld Token)
zh_hant: 預熱 — 上下文預填充 %1$lld%% (%2$lld/%3$lld 詞元)

source: Warming up — prefilling context %lld%% (%lld/1 token)
zh_hans: 预热中 — 预填充上下文 %1$lld%%（%2$lld/1 Token）
zh_hant: 預熱中 — 預填充上下文 %lld%%（%lld/1 token）

source: Warming up — prefilling context…
zh_hans: 预热 — 预填充上下文…
zh_hant: 預熱 — 填充上下文…

source: Warming up…
zh_hans: 预热中…
zh_hant: 預熱中…

source: We're live on Product Hunt
zh_hans: 我们在 Product Hunt 上线了
zh_hant: 我們在 Product Hunt 上線了

source: Web
zh_hans: 网页
zh_hant: 網頁

source: Web Researcher
zh_hans: 网络研究员
zh_hant: 網絡研究員

source: Web search
zh_hans: 网页搜索
zh_hant: 網頁搜尋

source: Web search API with snippets tuned for LLMs.
zh_hans: 专为 LLM 优化摘要的网页搜索 API。
zh_hant: 專為 LLM 優化摘要的網頁搜尋 API。

source: Web search is now a native feature. This plugin's tools are no longer loaded — configure providers in Settings → Search. You can uninstall this plugin.
zh_hans: 网页搜索现在是原生功能。此插件的工具不再加载 — 在设置 → 搜索中配置提供商。你可以卸载此插件。
zh_hant: 網頁搜尋現在是原生功能。此插件的工具不再載入 — 在設定 → 搜尋中設定供應商。您可以解除安裝此插件。

source: Web search is now built in
zh_hans: 网页搜索现在内置
zh_hant: 網頁搜尋現在內建

source: Web Search is off
zh_hans: 网页搜索已关闭
zh_hant: 網頁搜尋已關閉

source: Web search is off — enable a source to let agents search
zh_hans: 网页搜索已关闭 — 启用来源以允许智能体搜索
zh_hant: 網頁搜尋已關閉 — 啟用來源以允許智慧體搜尋

source: Web Search is on
zh_hans: 网页搜索已开启
zh_hant: 網頁搜尋已開啟

source: Web Search needs attention
zh_hans: 网页搜索需要关注
zh_hant: 網頁搜尋需要關注

source: Web URL
zh_hans: 网页 URL
zh_hant: 網頁 URL

source: Web, news, and image search. No key needed; used only when other sources fail.
zh_hans: 网页、新闻和图片搜索。无需密钥；仅在其他源失败时使用。
zh_hant: 網頁、新聞和圖片搜尋。無需金鑰；僅在其他源失敗時使用。

source: Webhook removed. Long polling can receive updates now.
zh_hans: Webhook 已移除。长轮询现在可以接收更新了。
zh_hant: Webhook 已移除。長輪詢現在可以接收更新了。

source: What the agent has stored, at a glance.
zh_hans: 智能体存储内容一览。
zh_hant: 代理儲存內容一覽。

source: What the agent may do inside the sandbox.
zh_hans: 智能体在沙盒内可以做什么。
zh_hant: 代理在沙箱內可以做什麼。

source: When you turn it on for an agent, Browser Use lets that agent browse the web for you — navigating pages, reading content, filling forms, and working through a goal step by step, with every action shown in a live feed.
zh_hans: 当你为智能体开启浏览器使用时，该智能体可以为你浏览网页 — 导航页面、阅读内容、填写表单并逐步完成目标，每个操作都在实时动态中显示。
zh_hant: 當你為智能體開啟瀏覽器使用時，該智能體可以為你瀏覽網頁 — 導航頁面、閱讀內容、填寫表單並逐步完成目標，每個操作都在即時動態中顯示。

source: Where agents may look
zh_hans: 智能体可以查看的位置
zh_hant: 智慧體可以查看的位置

source: Where Osaurus stores data on disk — and how it's protected
zh_hans: Osaurus 在磁盘上存储数据的位置及其保护方式
zh_hant: Osaurus 在磁盤上存儲數據的位置及其保護方式

source: Where this tool comes from
zh_hans: 此工具的来源
zh_hant: 此工具的來源

source: Why Encryption Is Opt-In
zh_hans: 为什么加密是可选的
zh_hant: 為什麼加密是可選的

source: Window usage
zh_hans: 窗口使用
zh_hant: 窗口使用

source: With a database, the agent can keep notes, lists, and records between conversations — stored encrypted on this Mac. You can browse and edit everything it saves right here.
zh_hans: 有了数据库，智能体可以在对话之间保存笔记、列表和记录 — 以加密形式存储在此 Mac 上。你可以浏览和编辑它保存的所有内容。
zh_hant: 有了資料庫，代理可以在對話之間儲存筆記、清單和誌錄 — 以加密形式儲存在此 Mac 上。你可以瀏覽和編輯它儲存的所有內容。

source: With a working folder, allow creating and editing its files (tracked and undoable in Changes). Off keeps the folder read-only.
zh_hans: 使用工作文件夹时，允许创建和编辑其文件（在「更改」中可跟踪和可撤销）。关闭则保持文件夹只读。
zh_hant: 使用工作資料夾時，允許建立和編輯其檔案（在「更改」中可追蹤和可復原）。關閉則保持資料夾唯讀。

source: Work on files in the mounted folder: read, edit, search, run commands, commit
zh_hans: 处理挂载文件夹中的文件：读取、编辑、搜索、运行命令、提交
zh_hant: 處理掛載檔案夾中的檔案：讀取、編輯、搜尋、運行命令、提交

source: Working folder is read-only in sandbox mode — code runs in the sandbox. Right-click to allow writes.
zh_hans: 工作文件夹在沙盒模式下为只读 — 代码在沙盒中运行。右键点击以允许写入。
zh_hant: 工作資料夾在沙盒模式下為唯讀 — 程式碼在沙盒中執行。按右鍵以允許寫入。

source: Workspace Assistant
zh_hans: 工作区助手
zh_hant: 工作區助手

source: Workspace IDs
zh_hans: 工作区 ID
zh_hant: 工作區 ID

source: Workspace loaded. Choose channels and senders — changes save automatically.
zh_hans: 工作区已加载。选择频道和发送者 — 更改自动保存。
zh_hant: 工作區已載入。選擇頻道和傳送者 — 更改自動儲存。

source: Workspace, server, or team ids this connection may inspect.
zh_hans: 此连接可以检查的工作区、服务器或团队 ID。
zh_hant: 此連線可以檢查的工作區、伺服器或團隊 ID。

source: Writable Channel IDs
zh_hans: 可写入的频道 ID
zh_hant: 可寫入的頻道 ID

source: Writable Chat IDs
zh_hans: 可写入的聊天 ID
zh_hant: 可寫入的聊天 ID

source: Write
zh_hans: 写入
zh_hant: 寫入

source: Write Room Allowlist
zh_hans: 写入房间允许列表
zh_hant: 寫入房間允許清單

source: You have your own search providers configured - they keep handling searches while premium is off.
zh_hans: 你已配置自己的搜索提供商 — 在高级搜索关闭时它们继续处理搜索。
zh_hant: 你已設定自己的搜尋提供商 — 在高級搜尋關閉時它們繼續處理搜尋。

source: You.com API key
zh_hans: You.com API 密钥
zh_hant: You.com API 金鑰

source: Your agents can now browse the web for you — navigating pages, reading content, and filling forms, with every step shown in a live feed. Each agent gets its own persistent browser session, so cookies and sign-ins carry over between chats but are never shared with other agents or your regular browser. If you used the browser plugin before, your sessions were migrated automatically.
zh_hans: 你的智能体现在可以为你浏览网页 — 导航页面、阅读内容和填写表单，每一步都实时展示在信息流中。每个智能体拥有独立的持久化浏览器会话，因此 Cookie 和登录状态可在对话间延续，但绝不会与其他智能体或你常用的浏览器共享。如果你之前使用过浏览器插件，你的会话已自动迁移。
zh_hant: 您的智慧體現在可以為您瀏覽網頁 — 導航頁面、閱讀內容和填寫表單，每一步都即時展示在資訊流中。每個智慧體擁有獨立的持久化瀏覽器工作階段，因此 Cookie 和登入狀態可在對話間延續，但絕不會與其他智慧體或您常用的瀏覽器共用。如果您之前使用過瀏覽器插件，您的工作階段已自動遷移。

source: Your agents can search the web out of the box — no plugin, no API key required. Free sources are on by default, and if you used the search plugin before, your API keys were carried over automatically.
zh_hans: 你的智能体开箱即可搜索网页 — 无需插件，无需 API 密钥。免费来源默认启用，如果你之前使用过搜索插件，你的 API 密钥会自动转移。
zh_hant: 您的智慧體開箱即可搜尋網頁 — 無需插件，無需 API 金鑰。免費來源預設啟用，如果您之前使用過搜尋插件，您的 API 金鑰會自動轉移。

source: Your Custom Tools
zh_hans: 你的自定义工具
zh_hant: 你的自訂工具

source: Your provider
zh_hans: 你的提供商
zh_hant: 您的供應商

source: Your Providers
zh_hans: 你的提供商
zh_hant: 您的供應商

source: Yours
zh_hans: 你的
zh_hant: 你的

source: README
zh_hant: 自述
